Fluidized_bed_V025/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type basicMultiphaseSystem;

phases (particles air);

particles
{
    type          purePhaseModel;
    diameterModel constant;
    constantCoeffs
    {
        d               3e-4;
    }

    alphaMax        0.62;
    residualAlpha   1e-6;
}

air
{
    type          purePhaseModel;
    diameterModel constant;
    constantCoeffs
    {
        d               1;
    }

    residualAlpha   0;
}

blending
{
    default
    {
        type            linear;
        minFullyContinuousAlpha.air 0.7;
		minPartlyContinuousAlpha.air 0.3;
		minFullyContinuousAlpha.particles 0.7;
		minPartlyContinuousAlpha.particles 0.3;
    }
}

surfaceTension
(
    (particles and air)
    {
        type            constant;
        sigma           0;
    }
);

aspectRatio
();

drag
(
    (particles in air)
    {
        type            GidaspowErgunWenYu;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
(
    (particles in air)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
);

heatTransfer
(
    (particles in air)
    {
        type            RanzMarshall;
        residualAlpha   1e-3;
    }
);

phaseTransfer
();

lift
();

wallLubrication
();

turbulentDispersion
();

interfaceCompression
();

// ************************************************************************* //
